tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jenkins-x/jx"
tap "lhopki01/brew", "git@github.com:lhopki01/brew"
tap "weaveworks/tap"
cask "adoptopenjdk8"
cask "osxfuse"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Record and share terminal sessions
brew "asciinema"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU binary tools for native development
brew "binutils"
# Calico CLI tool
brew "calicoctl"
# CloudFlare's PKI toolkit
brew "cfssl"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# macOS Credential Helper for Docker
brew "docker-credential-helper"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# The Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Helm Charts as Code tool
brew "helmsman"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
# LastPass command-line interface tool
brew "lastpass-cli"
# Pager program similar to more
brew "less"
# Text-based web browser
brew "lynx"
# Macro processing language
brew "m4"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Command-line client for Mega.co.nz
brew "megatools"
# Small, fast, single-package Kubernetes for developers, IoT and edge
brew "microk8s"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule", link: false
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@10"
# Platform built on V8 to build network applications
brew "node@12"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Monitor data's progress through a pipe
brew "pv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Local dev environment attached to a remote Kubernetes cluster
brew "telepresence"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Black box WordPress vulnerability scanner
brew "wpscan"
# Linter for YAML files
brew "yamllint", link: false
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# A tool to install and interact with Jenkins X on your Kubernetes cluster.
brew "jenkins-x/jx/jx"
brew "lhopki01/brew/dirin"
# Tool to build multiple dependent docker images in the correct order
brew "lhopki01/brew/docker-chain-builder"
# Tool to keep multiple local repos in sync with github
brew "lhopki01/brew/git-mass-sync"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "alfred"
cask "altserver"
cask "amazon-chime"
cask "anaconda"
cask "arduino"
cask "authy"
cask "balenaetcher"
cask "brave-browser"
cask "calibre"
cask "camera-live"
cask "canon-pixma-scanner-driver-ica"
cask "charles"
cask "chromedriver"
cask "colloquy"
cask "cyberduck"
cask "dash"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "dotnet-sdk"
cask "duet"
cask "eddie"
cask "evernote"
cask "fanny"
cask "firefox"
cask "font-bitter"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-input"
cask "font-kreon"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "gnucash"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hex-fiend"
cask "iterm2"
cask "jabra-direct"
cask "jenkins-menu"
cask "kensington-trackball-works"
cask "keybase"
cask "little-snitch"
cask "logitech-options"
cask "macs-fan-control"
cask "malwarebytes"
cask "microsoft-teams"
cask "monitorcontrol"
cask "mono-mdk-for-visual-studio"
cask "onionshare"
cask "openvpn-connect"
cask "pgadmin4"
cask "postman"
cask "protonmail-bridge"
cask "pycharm-ce"
cask "raspberry-pi-imager"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "slack"
cask "sony-ps4-remote-play"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "the-unarchiver"
cask "tor-browser"
cask "tunnelblick"
cask "unity"
cask "unity-hub"
cask "vagrant"
cask "virtualbox"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "wireshark"
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "Comment Wrapper", id: 1377998565
mas "Evernote Web Clipper", id: 1481669779
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Honey", id: 1472777122
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SketchBook", id: 863486266
mas "Xcode", id: 497799835
