tap "aws/tap"
tap "bazelbuild/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jenkins-x/jx"
tap "karhoo/brew", "git@github.com:karhoo/brew"
tap "karhoo/envy", "git@github.com:karhoo/envy"
tap "lhopki01/brew", "git@github.com:lhopki01/brew"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU binary tools for native development
brew "binutils"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker Machine Parallels Driver
brew "docker-machine-parallels"
# Classic UNIX line editor
brew "ed"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Pager program similar to more
brew "less"
# Macro processing language
brew "m4"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Extract, view, and test RAR archives
brew "unrar"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Black box WordPress vulnerability scanner
brew "wpscan"
# Linter for YAML files
brew "yamllint"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Fast, scalable, multi-language and extensible build system
brew "bazelbuild/tap/bazel"
brew "github/gh/gh"
brew "jenkins-x/jx/jx"
# A tool for deploying and managing Karhoo's Kubernetes-based services.
brew "karhoo/envy/envy"
# Collection of common Karhoo tools
brew "karhoo/brew/k-tools"
# The Kubernetes package manager
brew "karhoo/brew/kubernetes-helm"
# Tool to build multiple dependent docker images in the correct order
brew "lhopki01/brew/docker-chain-builder"
# Tool to keep multiple local repos in sync with github
brew "lhopki01/brew/git-mass-sync"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "alfred"
cask "anaconda"
cask "arduino"
cask "balenaetcher"
cask "brave-browser"
cask "canon-pixma-scanner-driver-ica"
cask "charles"
cask "cyberduck"
cask "dash"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "duet"
cask "eddie"
cask "evernote"
cask "firefox"
cask "font-bitter"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-input"
cask "font-kreon"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "jabra-direct"
cask "kensington-trackball-works"
cask "keybase"
cask "logitech-options"
cask "onionshare"
cask "pgadmin4"
cask "postman"
cask "protonmail-bridge"
cask "pycharm-ce"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "the-unarchiver"
cask "tor-browser"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
mas "Comment Wrapper", id: 1377998565
mas "Evernote Web Clipper", id: 1481669779
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Honey", id: 1472777122
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SketchBook", id: 863486266
mas "Xcode", id: 497799835
