tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "git"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "gzip"
brew "hashcat"
brew "jq"
brew "less"
brew "m4"
brew "make"
brew "mas"
brew "nano"
brew "nmap"
brew "screen"
brew "stow"
brew "unrar"
brew "watch"
brew "wdiff"
brew "wget"
brew "wpscan"
brew "yamllint"
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "anaconda"
cask "cyberduck"
cask "dash"
cask "eddie"
cask "evernote"
cask "firefox"
cask "iterm2"
cask "keybase"
cask "logitech-options"
cask "postman"
cask "protonmail-bridge"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
mas "1Blocker", id: 1107421413
mas "Evernote Web Clipper", id: 1481669779
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Honey", id: 1472777122
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
