tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Record and share terminal sessions
brew "asciinema"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU binary tools for native development
brew "binutils"
# Calico CLI tool
brew "calicoctl"
# CloudFlare's PKI toolkit
brew "cfssl"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# macOS Credential Helper for Docker
brew "docker-credential-helper"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Publish-subscribe messaging rethought as a distributed commit log
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Automated testing for Ansible roles
brew "molecule", link: false
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Monitor data's progress through a pipe
brew "pv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Black box WordPress vulnerability scanner
brew "wpscan"
# Linter for YAML files
brew "yamllint", link: false
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
cask "alfred"
cask "altserver"
cask "amazon-chime"
cask "anaconda"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "dotnet-sdk"
cask "font-bitter"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-input"
cask "font-kreon"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "iterm2"
cask "signal"
cask "skype"
